{
  "homepage": {
    "title": "Whats'up, I'm Vinícius👋🏻",
    "para": "Welcome to my web portfolio. I'm a full stack developer from Bahia, Brazil.",
    "curriculum": "Curriculum"
  },
  "footer": {
    "para": "Copyright | Web portfolio project created by Vinícius Silva Santos | "
  },
  "headerMenu": {
    "1": "About Me",
    "2": "Skills",
    "3": "Projects",
    "4": "Contact"
  },
  "cardButton": {
    "1": "Repository"
  },
  "emailForm": {
    "name": {
      "label": "Name",
      "errors": {
        "1": "Name is required"
      }
    },
    "subject": {
      "label": "Subject",
      "errors": {
        "1": "Subject is required"
      }
    },
    "message": {
      "label": "Message",
      "errors": {
        "1": "Message is required"
      }
    },
    "email": {
      "errors": {
        "1": "Invalid email"
      }
    },
    "button": "Send"
  },
  "contact": {
    "sub1": "Let's connect!",
    "sub2": "Contact Email",
    "sub3": "Social Media"
  },
  "dropdown": {
    "1": "choose an option"
  },
  "loading": {
    "1": "Loading"
  },
  "modal": {
    "title": "Email sent!",
    "message": "Thank you! Your message has been successfully sent. I will get back to you shortly. 😉"
  },
  "aboutpage": {
    "title": "Who am I?",
    "greetings": {
      "sub": "Hey! I'm Vinícius!",
      "paras": {
        "1": "I am a Full Stack Developer with a strong focus on the Backend, primarily working with Node.js and TypeScript to build scalable APIs, microservices, and distributed systems. I have experience in highly complex environments, actively participating in architectural decisions, defining standards, and implementing solutions focused on performance, security, and maintainability.",
        "2": "Throughout my career, I have worked on high-impact projects, including contexts with high demands for reliability and scalability. I have experience with microservices-based architectures, messaging (Kafka and Redis), authentication and authorization with Keycloak, as well as containerization with Docker and CI/CD practices. I have also worked with observability, log structuring, and monitoring to ensure greater visibility and stability in production.",
        "3": "My main stacks include TypeScript, Node.js (with NestJS), and React, along with complementary experience in Java and Go. I have hands-on experience with relational databases such as PostgreSQL and MySQL, NoSQL databases like MongoDB and Redis, and ORMs like Prisma and Mongoose. I am also familiar with GraphQL, design patterns, and good software engineering practices.",
        "4": "I am currently pursuing my degree in Information Systems, with a foundation built at IFBA, alongside continuous complementary training through courses and specializations. I strongly believe in continuous learning, constant improvement, and building solutions that truly generate a positive impact for people and businesses.",
        "5": "Beyond technical skills, I value autonomy with responsibility, teamwork collaboration, and active participation in strategic decisions. I enjoy challenging environments where I can evolve technically and contribute to long-term products. Outside of work, I maintain discipline with training, nutrition, and reading—pillars that I also apply to my professional life, striving for consistency and continuous evolution."
      }
    },
    "timeline": {
      "title": "Timeline",
      "1": {
        "title": "IFBA University",
        "sub": "2019 - Present",
        "description": "Bachelor of System Information. The IFBA, Federal Institute of Education, Science, and Technology of Bahia, is a federal public institution that offers professional technical courses at the higher education level in various cities of Bahia, Brazil."
      },
      "2": {
        "title": "Alura",
        "sub": "2021 - Present",
        "description": "Alura is the largest online technology school in Brazil, offering courses in programming, front-end, DevOps, mobile, Data Science, UX & Design, Artificial Intelligence, and Management & Innovation"
      },
      "3": {
        "title": "PMVC-CTI / Full Stack Software Development Intern",
        "sub": "Jun 2024 - Nov 2025",
        "description": "Developed solutions to optimize internal processes. Worked on the frontend using Vue.js (Quasar Framework) and backend using NestJS and Prisma ORM. Maintained and developed PostgreSQL databases."
      },
      "4": {
        "title": "4CodeTech / Back-End Developer",
        "sub": "Sep 2024 - Nov 2025",
        "description": "Developed solutions for financial institutions, national banks, and international tech companies. Worked with NestJS, Java, Angular, and Python, developing REST and GraphQL APIs, microservices, and gRPC integrations using Clean Architecture. Worked with AWS (Lambda, S3, API Gateway, SDK) and Serverless Framework. Utilized Docker, SFTP, K9s, and CI/CD pipelines, along with Grafana for monitoring."
      },
      "5": {
        "title": "Beyond TheBytes / Full Stack Developer",
        "sub": "Nov 2025 - Present",
        "description": "Operates in the full software development lifecycle (End-to-End). Develops modern and scalable web applications (SaaS) with the T3 stack (Next.js, TypeScript, Tailwind CSS, and Prisma ORM). Implements pixel-perfect interfaces with a focus on performance optimization (Core Web Vitals) and UX. Builds serverless backend architectures, including data modeling, secure APIs, and integration of authentication and data visualization systems."
      }
    },
    "hobbies": {
      "sub": "Whenever I'm not immersed in coding, I tend to dedicate my time to activities that contribute to my personal growth. Some of these activities include, but are not limited to:",
      "1": {
        "label": "Training:",
        "value": " To be honest, I have a deep passion for training. It's one of those things I can hardly let a day pass by without spending at least 30 minutes engaging in a workout session. The feeling of pushing my limits and witnessing progress is truly invigorating."
      },
      "2": {
        "label": "Reading:",
        "value": " If you're not an avid reader, you might not understand my love for books. I find solace in the world of literature, where every page turned is a new adventure. Whether it's fiction or non-fiction, the joy of gaining knowledge and exploring different perspectives is unmatched."
      },
      "3": {
        "label": "Cooking:",
        "value": " I've never been a fan of fast food, and I firmly believe in the joy of preparing my own meals. Experimenting with ingredients and creating delicious dishes brings me immense satisfaction. While not everyone may appreciate my culinary creations as much as I do, the verdict of my taste buds reigns supreme in this matter 😎."
      },
      "4": {
        "label": "Traveling:",
        "value": " Exploring new places has always been a source of inspiration for me. Whether it's discovering the beauty of nature or immersing myself in different cultures, traveling opens up a world of possibilities. Each journey is an opportunity to broaden my horizons and create lasting memories."
      }
    }
  },
  "skillsPage": {
    "certificates": {
      "title": "My Qualifications",
      "subtitle": "Certificates"
    },
    "softskills": {
      "title": "Soft Skills",
      "subtitle": "Soft skills that I consider crucial and am constantly refining.",
      "1": "Communication",
      "2": "Problem Solving",
      "3": "Teamwork",
      "4": "Adaptability",
      "5": "Time Management",
      "6": "Initiative",
      "7": "Continuous Learning",
      "8": "Attention to Detail",
      "9": "Critical Thinking",
      "10": "Leadership"
    },
    "stack": {
      "subtitle": "Stack",
      "categories": {
        "core": "Core Languages",
        "frontend": "Frontend",
        "backend": "Backend",
        "databases": "Databases & Storage",
        "cloud": "Cloud & Serverless",
        "devops": "DevOps & Observability",
        "messaging": "Messaging & Search",
        "testing": "Testing & Tooling"
      }
    }
  },
  "projectPage": {
    "moreProjects": "These are some of the projects I've worked on. You can find more on my GitHub, including experiments, contributions, and other developments.",
    "viewOn": "View more projects on",
    "github": "GitHub",
    "labTitle": "The Lab (Experiments)",
    "spotlight": "Spotlight",
    "errorTitle": "Projects Unavailable",
    "errorText": "The projects could not be loaded at this time.",
    "errorTip": "Tip: If running locally, make sure to start the project using pnpm dev:api so the local API (json-server) works correctly."
  }
}