{
  "homepage": {
    "title": "Whats'up, I'm Vinícius👋🏻",
    "para": "Welcome to my web portfolio. I'm a full stack developer from Bahia, Brazil.",
    "curriculum": "Curriculum"
  },
  "footer": {
    "para": "Copyright | Web portfolio project created by Vinícius Silva Santos | "
  },
  "headerMenu": {
    "1": "Projects",
    "2": "Certificates",
    "3": "Contact",
    "4": "About Me"
  },
  "cardButton": {
    "1": "Repository"
  },
  "emailForm": {
    "name": {
      "label": "Name",
      "errors": {
        "1": "Name is required"
      }
    },
    "subject": {
      "label": "Subject",
      "errors": {
        "1": "Subject is required"
      }
    },
    "message": {
      "label": "Message",
      "errors": {
        "1": "Message is required"
      }
    },
    "email": {
      "errors": {
        "1": "Invalid email"
      }
    },
    "button": "Send"
  },
  "contact": {
    "sub1": "Let's connect!",
    "sub2": "Contact Email",
    "sub3": "Social Media"
  },
  "dropdown": {
    "1": "choose an option"
  },
  "loading": {
    "1": "Loading"
  },
  "modal": {
    "title": "Email sent!",
    "message": "Thank you! Your message has been successfully sent. I will get back to you shortly. 😉"
  },
  "aboutpage": {
    "title": "About me",
    "greetings": {
      "sub": "Hey! I'm Vinícius Silva Santos!",
      "paras": {
        "1": "I'm a software developer passionate about programming and web development committed to driving innovation and excellence in every project I engage in.",
        "2": "My educational journey led me to study at one of the best teaching colleges in Bahia, IFBA, and also at the largest online technology school in Brazil, Alura. I am constantly seeking new challenges and opportunities to grow and learn.",
        "3": "My key skills include extensive knowledge in programming languages such as Java, Python, Javascript, and Typescript. I also have expertise in web technologies like HTML, CSS, and SQL, as well as frameworks like Vue and ReactJs. I am proficient in version control using GIT & GitHub and have knowledge of databases such as MySQL, MongoDB, and PostgreSQL. I believe that teamwork is the key to success, and I take pride in collaborating with colleagues to achieve exceptional results."
      }
    },
    "timeline": {
      "title": "Timeline",
      "1": {
        "title": "Alura",
        "sub": "2021 - Present",
        "description": "Alura is the largest online technology school in Brazil, offering courses in programming, front-end, DevOps, mobile, Data Science, UX & Design, Artificial Intelligence, and Management & Innovation"
      },
      "2": {
        "title": "IFBA University",
        "sub": "2019 - Present",
        "description": "Bachelor of System Information. The IFBA, Federal Institute of Education, Science, and Technology of Bahia, is a federal public institution that offers professional technical courses at the higher education level in various cities of Bahia, Brazil."
      },
      "3": {
        "title": "Full-Stack Developer - Internship",
        "sub": "2024/06 - Present",
        "description": "I contributed to the development of software solutions participating in everything from project documentation to backend, frontend database development. I used Vue.js with Quasar Framework on the frontend, with PrismaORM on the backend, and Postgres for the database. The projects developed addressed issues related to infrastructure and lifestyle in the city, as well as improving the organization of the city's own development team."
      }
    },
    "hobbies": {
      "sub": "Whenever I'm not immersed in coding, I tend to dedicate my time to activities that contribute to my personal growth. Some of these activities include, but are not limited to:",
      "1": "Training: To be honest, I have a deep passion for training. It's one of those things I can hardly let a day pass by without spending at least 30 minutes engaging in a workout session. The feeling of pushing my limits and witnessing progress is truly invigorating.",
      "2": "Reading: If you're not an avid reader, you might not understand my love for books. I find solace in the world of literature, where every page turned is a new adventure. Whether it's fiction or non-fiction, the joy of gaining knowledge and exploring different perspectives is unmatched.",
      "3": "Cooking: I've never been a fan of fast food, and I firmly believe in the joy of preparing my own meals. Experimenting with ingredients and creating delicious dishes brings me immense satisfaction. While not everyone may appreciate my culinary creations as much as I do, the verdict of my taste buds reigns supreme in this matter 😎.",
      "4": "Traveling: Exploring new places has always been a source of inspiration for me. Whether it's discovering the beauty of nature or immersing myself in different cultures, traveling opens up a world of possibilities. Each journey is an opportunity to broaden my horizons and create lasting memories."
    }
  }
}
