{
  "homepage": {
    "title": "Eai!👋🏻 Me chamo Vinícius",
    "para": "Seja bem-vindo ao meu portfólio. Sou um desenvolvedor full-stack, direto do interior da Bahia.",
    "curriculum": "Currículo"
  },
  "footer": {
    "para": "Copyright | Projeto para portfólio web criado por Vinícius Silva Santos | "
  },
  "headerMenu": {
    "1": "Sobre Mim",
    "2": "Habilidades",
    "3": "Projetos",
    "4": "Contato"
  },
  "cardButton": {
    "1": "Repositório"
  },
  "emailForm": {
    "name": {
      "label": "Nome",
      "errors": {
        "1": "Informe um nome"
      }
    },
    "subject": {
      "label": "Assunto",
      "errors": {
        "1": "Informe um assunto"
      }
    },
    "message": {
      "label": "Mensagem",
      "errors": {
        "1": "Informe uma mensagem"
      }
    },
    "email": {
      "errors": {
        "1": "Email inválido"
      }
    },
    "button": "Enviar"
  },
  "contact": {
    "sub1": "Vamos nos conectar!",
    "sub2": "Email para Contato",
    "sub3": "Adicione nas Redes"
  },
  "dropdown": {
    "1": "escolha uma opção"
  },
  "loading": {
    "1": "Carregando"
  },
  "modal": {
    "title": "Email enviado!",
    "message": "Obrigado! Sua mensagem foi enviada com sucesso. Em breve entrarei em contato com você. 😉"
  },
  "aboutpage": {
    "title": "Quem sou eu?",
    "greetings": {
      "sub": "Eai! Me chamo Vinícius!",
      "paras": {
        "1": "Sou um desenvolvedor Full-Stack apaixonado por tecnologia, com experiência em desenvolvimento de software, especializado em soluções Backend e tecnologias web. Atualmente, estou concluindo minha graduação em Sistemas de Informação e já atuei em projetos de grande impacto para clientes importantes, incluindo instituições financeiras e empresas internacionais. Estudei no IFBA, uma das principais instituições da Bahia, e na Alura, a maior escola de tecnologia online do Brasil. Busco sempre novos desafios, pois acredito que a aprendizagem contínua é essencial para a inovação.",
        "2": "Minhas principais habilidades incluem TypeScript, Java, JavaScript, Golang e Python, além de frameworks como Vue3, ReactJs, NestJS e NodeJs. Tenho experiência com MySQL, MongoDB, PostgreSQL e ORMs como Mongoose e Prisma. Também já trabalhei com migração de API Gateway, microsserviços, gRPC, scripting e autenticação com Keycloak, utilizando ferramentas como Docker, CI/CD e Grafana para garantir sistemas escaláveis.",
        "3": "Além das habilidades técnicas, valorizo o trabalho em equipe e a colaboração para impulsionar a inovação. Gosto de compartilhar conhecimento e resolver problemas em ambientes dinâmicos. Fora do trabalho, sou apaixonado por fitness, nutrição e leitura, acreditando que o crescimento pessoal é essencial para o sucesso a longo prazo."
      }
    },
    "timeline": {
      "title": "Timeline",
      "1": {
        "title": "Universidade IFBA",
        "sub": "2019 - Presente",
        "description": "Bacharelado em Sistemas de Informação. O IFBA, Instituto Federal de Educação, Ciência e Tecnologia da Bahia, é uma instituição pública federal que oferece cursos técnicos profissionais de nível superior em várias cidades da Bahia, Brasil."
      },
      "2": {
        "title": "Alura",
        "sub": "2021 - Presente",
        "description": "A Alura é a maior escola de tecnologia online do Brasil, oferecendo cursos em programação, front-end, DevOps, mobile, Data Science, UX & Design, Inteligência Artificial e Gestão & Inovação."
      },
      "3": {
        "title": "PMVC-CTI / Estágio Full Stack",
        "sub": "Jun 2024 - Nov 2025",
        "description": "Desenvolveu soluções para otimização de processos internos. Atuou no frontend com Vue.js (Quasar Framework) e no backend com NestJS e Prisma ORM. Realizou manutenção e desenvolvimento de bancos de dados PostgreSQL."
      },
      "4": {
        "title": "4CodeTech / Desenvolvedor Back-End",
        "sub": "Set 2024 - Nov 2025",
        "description": "Desenvolveu soluções para instituições financeiras, bancos nacionais e empresas de tecnologia internacionais. Atuou com NestJS, Java, Angular e Python, desenvolvendo APIs REST e GraphQL, microserviços e integração via gRPC, aplicando Clean Architecture. Trabalhou com AWS (Lambda, S3, API Gateway, SDK) e Serverless Framework. Utilizou Docker, SFTP, K9s e pipelines de CI/CD, além de monitoramento com Grafana."
      },
      "5": {
        "title": "Beyond TheBytes / Desenvolvedor Full Stack",
        "sub": "Nov 2025 - Presente",
        "description": "Atua no ciclo completo de desenvolvimento de software (End-to-End). Desenvolvimento de aplicações web modernas e escaláveis (SaaS) com a stack T3 (Next.js, TypeScript, Tailwind CSS e Prisma ORM). Implementação de interfaces (Pixel-Perfect) com foco em otimização de performance (Core Web Vitals) e UX. Construção de arquiteturas backend serverless, incluindo modelagem de dados, APIs seguras e integração de sistemas de autenticação e visualização de dados."
      }
    },
    "hobbies": {
      "sub": "Sempre que não estou imerso em codificação, costumo dedicar meu tempo a atividades que contribuem para o meu crescimento pessoal. Algumas dessas atividades incluem, mas não se limitam a:",
      "1": {
        "label": "Treinar:",
        "value": " Para ser honesto, tenho uma grande paixão por treinar. É uma daquelas coisas que dificilmente deixo um dia passar sem dedicar pelo menos 30 minutos a uma sessão de treino. A sensação de ultrapassar meus limites e testemunhar o progresso é verdadeiramente revigorante."
      },
      "2": {
        "label": "Leitura:",
        "value": " Se você não é um leitor ávido, talvez não entenda meu amor por livros. Encontro consolo no mundo da literatura, onde cada página virada é uma nova aventura. Seja ficção ou não-ficção, a alegria de adquirir conhecimento e explorar diferentes perspectivas é incomparável."
      },
      "3": {
        "label": "Cozinhar:",
        "value": " Nunca fui fã de fast food e acredito firmemente na alegria de preparar minhas próprias refeições. Experimentar ingredientes e criar pratos deliciosos me traz imensa satisfação. Embora nem todos possam apreciar minhas criações culinárias tanto quanto eu, o veredito das minhas papilas gustativas reina supremo nesta questão 😎."
      },
      "4": {
        "label": "Viajar:",
        "value": " Explorar novos lugares sempre foi uma fonte de inspiração para mim. Seja descobrindo a beleza da natureza ou me imergindo em diferentes culturas, viajar abre um mundo de possibilidades. Cada jornada é uma oportunidade de ampliar meus horizontes e criar memórias duradouras."
      }
    }
  },
  "skillsPage": {
    "certificates": {
      "title": "Minhas Qualificações",
      "subtitle": "Certificados"
    },
    "softskills": {
      "title": "Habilidades Interpessoais",
      "subtitle": "Habilidades interpessoais que considero cruciais e que estou constantemente aprimorando.",
      "1": "Comunicação",
      "2": "Resolução de Problemas",
      "3": "Trabalho em Equipe",
      "4": "Adaptabilidade",
      "5": "Gestão de Tempo",
      "6": "Iniciativa",
      "7": "Aprendizado Contínuo",
      "8": "Atenção aos Detalhes",
      "9": "Pensamento Crítico",
      "10": "Liderança"
    },
    "stack": {
      "subtitle": "Stack",
      "categories": {
        "core": "Linguagens Principais",
        "frontend": "Frontend",
        "backend": "Backend",
        "databases": "Bancos de Dados & Storage",
        "cloud": "Cloud & Serverless",
        "devops": "DevOps & Observabilidade",
        "messaging": "Mensageria & Busca",
        "testing": "Testes & Ferramentas"
      }
    }
  },
  "projectPage": {
    "moreProjects": "Esses são alguns dos projetos em que trabalhei. Você pode encontrar mais no meu GitHub, incluindo experimentos, contribuições e outros desenvolvimentos.",
    "viewOn": "Ver mais projetos no",
    "github": "GitHub",
    "labTitle": "O Laboratório (Experimentos)",
    "spotlight": "Destaques"
  }
}